[{"text":"Can you twin cast Alter Self?","type":0},{"text":"How long does it take to drink a potion?","type":0},{"text":"Can a multiclass barbarian monk add both Wisdom and Constitution to AC?","type":0},{"text":"Can you use Extra Attack if you Ready an attack?","type":0},{"text":"Is it an action to use a spell scroll?","type":0},{"text":"If you cast Invisibility on yourself, can you also Ready to cast Firebolt?","type":0},{"text":"If you Ready a Firebolt and an enemy hits you with an attack before it is triggered, what follows?","type":0},{"text":"Can a grappled creature attack?","type":0},{"text":"Does a grappled creature attack at disadvantage?","type":0},{"text":"Does a poisoned creature receive poison damage every turn?","type":0},{"text":"Can an incapacitated creature move?","type":0},{"text":"A melee character is surrounded by three enemies. One goes invisible and moves out of his reach. The other moves out of his reach and takes the Dash action. And the third disengages and moves out of his reach. Who can the fighter take an opportunity attack against? And can he make more than one opportunity attack?","type":0},{"text":"Does a larger creature have advantage on grapple checks against a smaller creature?","type":0},{"text":"Does Disengage work for all opportunity attacks, or only one?","type":0},{"text":"Does Animate Objects deal magic damage?","type":0},{"text":"If you have a movement speed of 30 ft. and a fly speed of 50 ft. how far away can you move if you get up from prone at the start of your turn without the dash action?","type":0},{"text":"How many level 2 spells can a level 3 Cleric prepare each day?","type":0},{"text":"What is the difference between Flight and Hover?","type":0},{"text":"What happens when you are knocked prone while flying by magical means, such as the Fly spell.","type":0},{"text":"How many Superiority Dice can a Battlemaster use each turn?","type":0},{"text":"Can you Counterspell a Subtle Chromatic Orb?","type":0},{"text":"What classes can dash as a bonus action?","type":0},{"text":"Can you make an attack of opportunity with a reach weapon at 5 ft.?","type":0},{"text":"Can a druid wildshape directly from one animal to another?","type":0},{"text":"Can a level 3 Bard know four level 2 spells?\n","type":0},{"text":"How many level 2 spells can a level 3 Cleric prepare each day?","type":0},{"text":"How many Superiority Dice can a Battlemaster use each turn?","type":0},{"text":"Can multiclassed Sorcerers get Sorcery Points from their other classes’ spell slots?","type":0},{"text":"Can you Counterspell a Counterspell?","type":0},{"text":"Can a Ranger cast Shield from a spell scroll?","type":0},{"text":"What happens if someone rolls a nat1 for an ability check but the total is over the DC?","type":0},{"text":"What happens if someone rolls a nat1 for an attack roll but the total is over the AC?","type":0},{"text":"Who goes first if there is an initiative tie?","type":0},{"text":"Can you grapple/shove as an opportunity attack?","type":0},{"text":"Can you shoot an arrow as an opportunity attack?","type":0},{"text":"Do you roll Medicine with advantage when using a Healer’s Kit?","type":0},{"text":"Can you ready Misty Step?","type":0},{"text":"Can you apply Guidance on initiative?","type":0},{"text":"Can you cast Spirit Guardians and Spiritual Weapon on the same turn?","type":0},{"text":"Can you cast Fireball and Counterspell on the same turn?","type":0},{"text":"Can a Sorcerer cast Fireball then quicken another Fireball?","type":0},{"text":"Can a Paladin use Wrathful Smite after the attack roll?","type":0},{"text":"Can a player use a bardic inspiration die before or after a roll?","type":0},{"text":"Does a Paladin use Divine Smite before or after the attack?","type":0},{"text":"Can a player use a DM inspiration before or after a roll?","type":0},{"text":"Does a Monk use Stunning Strike before or after the attack?","type":0},{"text":"Can you add Bardic Inspiration to an attack roll?","type":0},{"text":"Can you add Bardic Inspiration to a damage roll?","type":0},{"text":"Can a monk use flurry of blows if they didn't use the attack action?","type":0},{"text":"Can you upcast Shield?","type":0},{"text":"Can a 6th level Druid transform into a raven?","type":0},{"text":"Does Rogue get Sneak Attack with their longsword on a prone enemy?","type":0},{"text":"Does Rogue get Sneak Attack with their bow on a prone enemy?","type":0},{"text":"What happens when you receive 8 temp hp, but already have 4 temp hp?","type":0},{"text":"Does prone Rogue get Sneak Attack with their shortsword on an enemy?","type":0},{"text":"Can a Rogue with Extra Attack apply Sneak Attack on all their attacks?","type":0},{"text":"If a Rogue applied Sneak Attack on their turn, can they apply it again on an opportunity attack with their Rapier?","type":0},{"text":"Can a Wizard change their prepared spells mid-combat?","type":0},{"text":"Can a Sorcerer change their prepared spells mid-combat?","type":0},{"text":"How many spell slots does a Cleric recharge on a Short Rest?","type":0},{"text":"Does being pushed by Thunderwave provoke opportunity attacks?","type":0},{"text":"Is Thunderwave centered on yourself?","type":0},{"text":"Can a Fighter take a second bonus action when they use Action Surge?","type":0},{"text":"How much damage would you take if you fell from a 300 ft height?","type":0},{"text":"Do you instantly fall to the ground from a 666 ft height?","type":0},{"text":"Why does the level 3 Warlock roll 1d10+3 for Eldritch Blast damage when it only deals 1d10 per beam?","type":0},{"text":"Do you add your Proficiency Bonus to damage rolls?","type":0},{"text":"Does a Warlock get spell slots back if their long rest gets interrupted after 4 hours?","type":0},{"text":"If you are hit by a 28 damage fireball, pass your save and have resistance to fire how much damage do you take?","type":0},{"text":"If a creature is resistant to non-magical weapon attacks do they take half damage from fall damage?","type":0},{"text":"Can you dual wield longswords?","type":0},{"text":"Do you add proficiency bonus to both dual wielding attack rolls?","type":0},{"text":"Do you add Strength/Dexterity to both dual wielding damage rolls?","type":0},{"text":"Does a Rogue need Flanking to Sneak Attack?","type":0},{"text":"What happens if you grapple a flying creature?","type":0},{"text":"Can you grapple creatures larger than you?","type":0},{"text":"Do you need to roll Athletics to jump?","type":0},{"text":"Can a creature enter a Bag of Holding?","type":0},{"text":"Can a creature enter a Portable Hole?","type":0},{"text":"What happens if someone with a Bag of Holding enters a Portable Hole?","type":0},{"text":"Can you put a Bag of Holding inside a Bag of Holding?","type":0},{"text":"Can someone retrieve a Potion from a Bag of Holding and drink it on the same turn?","type":0},{"text":"Can someone cast spells while under the effects of Polymorph?","type":0},{"text":"If you Polymorph yourself, do you roll for concentration using your or the beast’s Constitution score?'","type":0},{"text":"Does it cost half your movement to drop prone?","type":0},{"text":"Can a grappled prone creature stand up?","type":0},{"text":"How many creatures can a level 14 Loxodon Fighter grapple in one round?","type":0},{"text":"How many attacks can a multiclass Fighter 11/Ranger 5 make with his action?","type":0},{"text":"How many attacks can a multiclass Fighter 5/Ranger 5 make with his action?","type":0},{"text":"Can a multiclass Monk/Rogue apply Sneak Attack on their DEX based unarmed strikes?","type":0},{"text":"Can a Human Variant Paladin pick War Caster feat at level 1?","type":0},{"text":"A creature with 30 ft speed is hit by two Rays of Frost. What is the creature’s speed on its turn?","type":0},{"text":"Two level 6 Paladins are standing next to each other (= 5ft). Paladin A has 16 Charisma score, Paladin B has 12 Charisma score. What is each Paladin’s final boost to saving throws (from Aura of Protection)?","type":0},{"text":"Two people in your party have access to Aid. One caster casts it at level 3, the other one casts it at level 5. Assuming both targeted the exact same people, what is the final max HP increase?","type":0},{"text":"The enemy creature has 20 passive Perception against our level 13 party. The Ranger tries to hide but rolls a nat1 and with a modifier of +25 gets 26 total. The Paladin tries to hide, rolls a nat20 and with a modifier of -1 gets 19 total. Based on the dice rolls, state whether each of them is hidden from the enemy or not. Bonus question: How can the Ranger get +25 stealth mod?","type":0},{"text":"How much damage would a multiclassed Paladin 6/Sorcerer 5 do with a Firebolt?","type":0},{"text":"How much damage would a level 5 Paladin take from a 28 damage Fireball after rolling nat1 with a modifier of +0 for the saving throw?","type":0},{"text":"Does resistance to the same element from different sources stack?","type":0},{"text":"A +1 Bloodwell Vial requires a few drops of your blood to attune to it. Is a level 11 Warforged Warlock able to attune to it?","type":0},{"text":"Can a rogue add sneak attack damage to a thrown weapon attack made as the bonus action of two weapon fighting?","type":0},{"text":"What happens to your speed when moving while squeezing?","type":0}]