[{"text":"What is the max rewards for a party consisting of a level 10 artificer, level 11 wizard, level 12 fighter and level 13 rogue?","type":1},{"text":"What are the minimum rewards for a party consisting of level 3, 4 and 5 fighters?","type":1},{"text":"What does a red row on the jaysheet mean?","type":1},{"text":"Where can you find out what is available for sale in Jaytown out of session?","type":1},{"text":"What are the limitations on the boon you receive when you complete your level 20 quest?","type":1},{"text":"How do you give out minor conditions/blessing to players?","type":1},{"text":"If Bob, Sue and Bill are all level 10 monks.  They have earned two sessions worth of full rolling rewards.  Bob and Sue complete the final part, how much rewards can they get?","type":1},{"text":"You want to give a party a magic bow that shoots different arrow types and a magic sword +2 that tells puns that can paralyze enemies.  How would you do this?","type":1},{"text":"A party of new adventurers complete a simple quest to kill some wolves outside of Jaytown in the Feywild Forest.  What sort of lore log do you submit?","type":1},{"text":"What home rules are allowed in games?","type":1},{"text":"A level 3 wizard wants to craft a scroll of Charm person.  What does it cost them and what proficencies do they need?","type":1},{"text":"A level 6 artificer has a recipe for +1 All-Purpose Tool.  What does it cost them and what proficencies do they need?","type":1},{"text":"A level 10 artificer wishes to learn how to craft a +2 All-Purpose Tool?  What would the recipe cost them?","type":1},{"text":"What is the preferred set of rewards for a party of 3 level 7 fighters that just defeated a necromancer, his three apprentices, and a few zombies?\nA) 2700 gp\nB) +1 long swords, +1 great axe, +1 rapier and 900 gp\nC) A spellbook with Animate Dead, an arcane grimore +1 and 1000 gp","type":1},{"text":"Bob and Sue are both wizards in a session and wish to copy spells.  How many spells can they copy from each other?","type":1},{"text":"A level 2 monk is bit by a werewolf and acquires the curse of lycanthopy.  What happens to her and how is it recorded in the gsheet?","type":1},{"text":"Scarlet (+20ish persuasion rolls) a nat 20 when asking Trent to raise one of her friends from the dead.  Assume that the normal cost is 5000gp.  What is the minimum she can pay to save her friend?","type":1},{"text":"Players go to a store looking for magic items.  What items can they buy?","type":1},{"text":"What are the limits on wish?","type":1},{"text":"A level 1 Yuan-Ti Pureblood warlock is inside of a Thunderclap spell.  What happens?","type":1},{"text":"A simulacrum of a level 19 wizard with all their spell slots remaining casts Simulacrum.  How many spell slots does the new simulacrum have?","type":1},{"text":"What does it cost to create a Clone?","type":1},{"text":"How many clones can you have in waiting?","type":1},{"text":"What spell components are not available from Lena?","type":1},{"text":"What limitations are there on magic items that can be given to a humanoid Steel Defender?","type":1},{"text":"Can a player cast fireball and hit a party member if that member asks not to be hit, but there is no alternative location?","type":1}]